app/controllers/session_controller.rb

  def callback

    @request_token = OAuth::RequestToken.new(SessionController.consumer, session[:request_token_token], session[:request_token_secret])
    @access_token = @request_token.get_access_token(:oauth_verifier => params[:oauth_verifier])

    response = @access_token.get("/api/base/profile")

    user_info = Hpricot.parse(response.body)

    modyo_id = (user_info/:id).inner_html

    @user = User.find_by_modyo_id(modyo_id)
    if @user
      session[:user_id] = @user.id
      @user.update_attributes(:token => @access_token.token,
        :secret => @access_token.secret,
        :full_name => (user_info/:full_name).inner_html,
        :nickname => (user_info/:nickname).inner_html,
        :image_url => (user_info/:avatar).inner_html,
        :birthday => (user_info/:birthday).inner_html,
        :sex => (user_info/:sex).inner_html,
        :country => (user_info/:country).inner_html,
        :lang => (user_info/:lang).inner_html)
---
SELECT * FROM `users` WHERE (`users`.`modyo_id` = '320985') LIMIT 1
UPDATE `users` SET `updated_at` = '2011-01-12 18:41:40', `full_name` = 'Ivan Gonzalez', `secret` = 'QOhqNOtBeQgreevgVzjR6i2afzJGEO3ccctKWaxS', `token` = 'XAGfpzIzOqeAwutr6AP2' WHERE `id` = 1

          :country => (user_info/:country).inner_html,
          :lang => (user_info/:lang).inner_html })

      @user.save!
---
INSERT INTO `users` (`created_at`, `image_url`, `country`, `nickname`, `token`, `updated_at`, `modyo_id`, `sex`, `full_name`, `birthday`, `lang`, `secret`) VALUES('2011-01-12 18:21:09', '', 'pt', 'Ivan', 'dSdUfdGTmxuekv3GqSUJ', '2011-01-12 18:21:09', 320985, 0, '', '1982-09-01', 'pt', 'bDdnMH5hZtIgB70XYtPWIZeXZ4hbiZgNXRORsuys')